app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Adware!"], ["updated_at", 2017-01-07 20:12:16 UTC], ["id", 1]]
---
	def update
	  @article = Article.find(params[:id])

  		if @article.update(article_params)